<template>
	<!--pages/my-order/my-order.wxml-->
	<view class="view">
		<navBar title="首页" background="#fff"></navBar>
		<!-- tab -->
		<u-tabs :list="tabs" :is-scroll="false" :current="currentIndex" @change="onTabChange"></u-tabs>
		<!-- 内容 -->
		<view>
			<view v-if="currentIndex == 2" class="noData">
				<image style="width:135px;height:135px;" src="/static/images/order/pic.png"></image>
				<view class="nodataTitle">当前暂无文章</view>
			</view>
			<view v-if="currentIndex == 0" class="kouzhao">
				<view class="duanluo">1. Analytic Visualizations（可视化分析）
					　　不管是对数据分析专家还是普通用户，数据可视化是数据分析工具最基本的要求。可视化可以直观的展示数据，让数据自己说话，让观众听到结果。</view>
				<view class="duanluo">Data Mining Algorithms（数据挖掘算法）
					　　可视化是给人看的，数据挖掘就是给机器看的。集群、分割、孤立点分析还有其他的算法让我们深入数据内部，挖掘价值。这些算法不仅要处理大数据的量，也要处理大数据的速度。
				</view>
				<view class="duanluo">3. Predictive Analytic Capabilities（预测性分析能力）
					　　数据挖掘可以让分析员更好的理解数据，而预测性分析可以让分析员根据可视化分析和数据挖掘的结果做出一些预测性的判断。 [2]

				</view>
				<view class="duanluo">（4. Semantic Engines（语义引擎）
					　　我们知道由于非结构化数据的多样性带来了数据分析的新的挑战，我们需要一系列的工具去解析，提取，分析数据。语义引擎需要被设计成能够从“文档”中智能提取信息。</view>
				<view class="duanluo">（5. Data Quality and Master Data Management（数据质量和数据管理）
					数据质量和数据管理是一些管理方面的最佳实践。通过标准化的流程和工具对数据进行处理可以保证一个预先定义好的高质量的分析结果。 [2]
					假如大数据真的是下一个重要的技术革新的话，我们最好把精力关注在大数据能给我们带来的好处，而不仅仅是挑战。
				</view>
				<view class="duanluo">6.数据存储，数据仓库
					数据仓库是为了便于多维分析和多角度展示数据按特定模式进行存储所建立起来的关系型数据库。在商业智能系统的设计中，数据仓库的构建是关键，是商业智能系统的基础，承担对业务系统数据整合的任务，为商业智能系统提供数据抽取、转换和加载(ETL)，并按主题对数据进行查询和访问，为联机数据分析和数据挖掘提供数据平台。
				</view>
			</view>
			<view v-if="currentIndex == 1" class="kouzhao">
				<view class="duanluo">人工智能的定义可以分为两部分，即“人工”和“智能”。“人工”比较好理解，争议性也不大。有时我们会要考虑什么是人力所能及制造的，或者人自身的智能程度有没有高到可以创造人工智能的地步，等等。但总的来说，“人工系统”就是通常意义下的人工系统。</view>
				<view class="duanluo">关于什么是“智能”，就问题多多了。这涉及到其它诸如意识（CONSCIOUSNESS）、自我（SELF）、思维（MIND）（包括无意识的思维（UNCONSCIOUS_MIND））等等问题。人唯一了解的智能是人本身的智能，这是普遍认同的观点。但是我们对我们自身智能的理解都非常有限，对构成人的智能的必要元素也了解有限，所以就很难定义什么是“人工”制造的“智能”了。因此人工智能的研究往往涉及对人的智能本身的研究。其它关于动物或其它人造系统的智能也普遍被认为是人工智能相关的研究课题。</view>
				<view class="duanluo">人工智能在计算机领域内，得到了愈加广泛的重视。并在机器人，经济政治决策，控制系统，仿真系统中得到应用。</view>
				<view class="duanluo">尼尔逊教授对人工智能下了这样一个定义：“人工智能是关于知识的学科――怎样表示知识以及怎样获得知识并使用知识的科学。”而另一个美国麻省理工学院的温斯顿教授认为：“人工智能就是研究如何使计算机去做过去只有人才能做的智能工作。”这些说法反映了人工智能学科的基本思想和基本内容。即人工智能是研究人类智能活动的规律，构造具有一定智能的人工系统，研究如何让计算机去完成以往需要人的智力才能胜任的工作，也就是研究如何应用计算机的软硬件来模拟人类某些智能行为的基本理论、方法和技术。</view>
				<view class="duanluo">人工智能是计算机学科的一个分支，二十世纪七十年代以来被称为世界三大尖端技术之一（空间技术、能源技术、人工智能）。也被认为是二十一世纪三大尖端技术（基因工程、纳米科学、人工智能）之一。这是因为近三十年来它获得了迅速的发展，在很多学科领域都获得了广泛应用，并取得了丰硕的成果，人工智能已逐步成为一个独立的分支，无论在理论和实践上都已自成一个系统。</view>
				<view class="duanluo">人工智能是研究使计算机来模拟人的某些思维过程和智能行为（如学习、推理、思考、规划等）的学科，主要包括计算机实现智能的原理、制造类似于人脑智能的计算机，使计算机能实现更高层次的应用。人工智能将涉及到计算机科学、心理学、哲学和语言学等学科。可以说几乎是自然科学和社会科学的所有学科，其范围已远远超出了计算机科学的范畴，人工智能与思维科学的关系是实践和理论的关系，人工智能是处于思维科学的技术应用层次，是它的一个应用分支。从思维观点看，人工智能不仅限于逻辑思维，要考虑形象思维、灵感思维才能促进人工智能的突破性的发展，数学常被认为是多种学科的基础科学，数学也进入语言、思维领域，人工智能学科也必须借用数学工具，数学不仅在标准逻辑、模糊数学等范围发挥作用，数学进入人工智能学科，它们将互相促进而更快地发展。</view>
			</view>
			<view v-if="currentIndex == 3" class="kouzhao">
				<view class="duanluo">超级计算机是指信息处理能力比个人计算机快一到两个数量级以上的计算机，它在密集计算、海量数据处理等领域发挥着举足轻重的作用。作为高性能计算技术产品的超级计算机，又称巨型机，是与高性能计算机或高端计算机相对应的概念。</view>
				<view class="duanluo">超级计算机具有很强的计算和处理数据的能力，主要特点表现为高速度和大容量，配有多种外部和外围设备及丰富的、高功能的软件系统。超级计算机采用涡轮式设计，每个刀片就是一个服务器，能实现协同工作，并可根据应用需要随时增减。以我国第一台全部采用国产处理器构建的“神威·太湖之光”为例，它的持续性能为9.3亿亿次/秒，峰值性能可以达到12.5亿亿次/秒。通过先进的架构和设计，实现了存储和运算的分开，确保用户数据、资料在软件系统更新或CPU升级时不受任何影响，保障了存储信息的安全，真正实现了保持长时、高效、可靠的运算并易于升级和维护的优势。</view>
				<view class="duanluo">根据处理器的不同，可以把超级计算机分为两类，采用专用处理器或者采用标准兼容处理器。前者可以高效地处理同一类型问题，而后者则可一机多用，使用范围比较灵活、广泛。专一用途计算机多见于天体物理学、密码破译等领域。国际“象棋高手”“深蓝”、日本的“地球模拟器”都属于这样的超级计算机，很多超级计算机是非专用系统，服务于军事、医药、气象、金融、能源、环境和制造业等众多领域。</view>
				<view class="duanluo">超级计算机是1929年《纽约世界报》中最先报道出的一个名词，它是将大量的处理器集中在一起以处理庞大
					超级计算机
					超级计算机
					的数据量，同时运算速度比常规计算机快许多倍。但是从结构上看，超级计算机和普通计算机都是大同小异的，而这种并行化处理使得人们可以对庞大数据进行处理，进而影响到各个行业运行，其意义十分重大，1976年美国克雷公司推出了世界上首台运算速度达每秒2.5亿次的超级计算机，突出表现一国科技实力的超级计算机，堪称集万千宠爱于一身的高科技宠儿，在诸如天气预报、生命科学的基因分析、核业、军事、航天等高科技领域大展身手，让各国科技精英竞折腰，各国都在着手研发亿亿级超级计算机</view>
				<view class="duanluo">一般来说，超级计算机的运算速度平均每秒1000万次以上，存贮容量在1000万位以上。如美国的ILLIAC-Ⅳ，日本的NEC，欧洲的尤金，中国的“银河”计算机，就属于巨型计算机。巨型计算机的发展是电子计算机的一个重要发展方向。它的研制水平标志着一个国家的科学技术和工业发展的程度，体现着国家经济发展的实力。一些发达国家正在投入大量资金和人力、物力，研制运算速度达几百万亿次的超级大型计算机。</view>
				<view class="duanluo">自2009年我国国防科技大学发布峰值性能为每秒1.206千万亿次的“天河一号”超级计算机，我国成为美国之后第二个可以独立研制千万亿次超级计算机的国家。尤其2016年神威太湖之光的出现，更是标志我国进入超算世界领先地位。超级计算机可以代表一个国家在信息数据领域的综合实力，甚至可以说影响到国家在世界科学技术上的地位，不仅如此，在大数据时代即将到来之际，超级计算机的实际应用也相当可观。</view>

			</view>

			<view v-if="currentIndex == 4" class="kouzhao">
				<view class="duanluo">量子力学态叠加原理使得量子信息单元的状态可以处于多种可能性的叠加状态，从而导致量子信息处理从效率上相比于经典信息处理具有更大潜力。普通计算机中的2位寄存器在某一时间仅能存储4个二进制数（00、01、10、11）中的一个，而量子计算机中的2位量子位（qubit）寄存器可同时存储这四种状态的叠加状态。随着量子比特数目的增加，对于n个量子比特而言，量子信息可以处于2种可能状态的叠加，配合量子力学演化的并行性，可以展现比传统计算机更快的处理速度。
				</view>
				<view class="duanluo">量子位
					量子位（qubit）是量子计算的理论基石。在常规计算机中，信息单元用二进制的 1 个位来表示，它不是处于“ 0” 态就是处于“ 1” 态. 在二进制量子计算机中，信息单元称为量子位，它除了处于“ 0” 态或“ 1”
					态外，还可处于叠加态（superposed state）。</view>
				<view class="duanluo">叠加态是“ 0” 态和“ 1” 态的任意线性叠加，它既可以是“ 0” 态又可以是“ 1” 态，“ 0” 态和“ 1” 态各以一定的概率同时存在.
					通过测量或与其它物体发生相互作用而呈现出“ 0” 态或 “ 1” 态.任何两态的量子系统都可用来实现量子位，例如氢原子中的电子的基态（ground state）和第 1 激发态（first excited state)、
					质子自旋在任意方向的+ 1/ 2 分量和- 1/ 2 分量、 圆偏振光的左旋和右旋等。</view>
				<view class="duanluo">一个量子系统包含若干粒子，这些粒子按照量子力学的规律运动，称此系统处于态空间的某种量子态。这里所说的态空间是指由多个本征态（eigenstate)
					（即基本的量子态）所张成的矢量空间，基本量子态简称基本态（basic state）或基矢（basic vector). 态空间可用Hilbert 空间（线性复向量空间）来表述，即Hilbert
					空间可以表述量子系统的各种可能的量子态.为了便于表示和运算，Dirac提出用符号|x〉 来表示量子态，|x〉 是一个列向量，称为ket ；它的共轭转置（conjugate t ranspose)
					用〈x|表示，〈x|是一个行向量，称为bra.一个量子位的叠加态可用二维Hilbert 空间（即二维复向量空间）的单位向量来描述。
				</view>
				<view class="duanluo">叠加原理
					把量子考虑成磁场中的电子。电子的旋转可能与磁场一致，称为上旋转状态，或者与磁场相反，称为下旋状态。如果我们能在消除外界影响的前提下，用一份能量脉冲能将下自旋态翻转为上自旋态；那么，我们用一半的能量脉冲，将会把下自旋状态制备到一种下自旋与上自旋叠加的状态上（处在每种状态上的几率为二分之一）。对于n个量子比特而言，它可以承载2的n次方个状态的叠加状态。而量子计算机的操作过程被称为幺正演化，幺正演化将保证每种可能的状态都以并行的方式演化。这意味着量子计算机如果有500个量子比特，则量子计算的每一步会对2^500种可能性同时做出了操作。2^500是一个可怕的数，它比地球上已知的原子数还要多（这是真正的并行处理，当今的经典计算机，所谓的并行处理器仍然是一次只做一件事情）。</view>
			</view>
		</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				tabs: [{
					name: '大数据计算',
					status: ''
				}, {
					name: '人工智能',
					status: 'WAIT_PAY'
				}, {
					name: '智能家具',
					status: 'ALREADY_PAY'
				}, {
					name: '超级计算机',
					status: 'VERIFIED'
				}, {
					name: '量子计算',
					status: 'CLOSED'
				}],
				currentIndex: 0,
				currentData: []
			};
		},

		props: {},

		/**
		 * 生命周期函数--监听页面加载
		 */
		onLoad: function(options) {},

		/**
		 * 生命周期函数--监听页面初次渲染完成
		 */
		onReady: function() {},

		/**
		 * 生命周期函数--监听页面显示
		 */
		onShow: function() {},
		methods: {
			/**
			 * 获取订单列表数据
			 */
			getOrderListData(exchangeStatus) {},

			/**
			 * tab 切换事件
			 */
			onTabChange(val) {
				console.log(val);
				this.currentIndex = val
			}

		}
	};
</script>
<style>
	/* pages/my-order/my-order.wxss */

	.van-info {
		top: 8px !important;
		right: 6px !important;
	}

	.view {
		background: rgba(250, 250, 250, 1);
	}

	.noData {
		display: flex;
		flex-direction: column;
		justify-content: center;
		align-items: center;
		height: 100vh;
	}

	.nodataTitle {
		font-size: 16px;
		font-family: PingFangSC-Medium;
		font-weight: 600;
		color: rgba(0, 0, 0, 1);
		line-height: 48px;
	}

	.nodataButton {
		width: 100px;
		height: 40px;
		background: #dbb678;
		border-radius: 4px;
		font-size: 14px;
		font-family: PingFangSC-Regular;
		font-weight: 400;
		color: rgba(255, 255, 255, 1);
		line-height: 40px;
		text-align: center;
	}

	/* 新增 */

	.van-tabs__line {
		background-color: #dbb678 !important;
		background-color: var(--tabs-bottom-bar-color, #dbb678) !important;
	}

	.kouzhao {
		padding: 28rpx 32rpx;
	}

	.duanluo {
		text-indent: 2em;
		font-size: 28rpx;
	}
</style>
